src/Phreeagent/Test/raw_response/invoice/fetch_success.json

{"invoice":{"url":"https://api.sandbox.freeagent.com/v2/invoices/2714","contact":"https://api.sandbox.freeagent.com/v2/contacts/3293","dated_on":"2013-10-18","due_on":"2013-11-17","reference":"001","currency":"GBP","exchange_rate":"1.0","net_value":"6750000.0","total_value":"6750000.0","paid_value":"0.0","due_value":"6750000.0","status":"Open","omit_header":false,"payment_terms_in_days":30,"invoice_items":[{"url":"https://api.sandbox.freeagent.com/v2/invoice_items/6342","position":1,"description":"Death Star","item_type":"Years","price":"450000.0","quantity":"15.0","category":"https://api.sandbox.freeagent.com/v2/categories/001"}]}}
